'''
    코딩테스트에서 나올 수 있는 그래프 표현 방법
    1. 인접 리스트(Adjacency List) - u -> [v1,v2,...] 또는 u -> [(v1,w2),(v2,w2),...]
        -> BFS/DFS/다익스트라에 표준
    2. 간선 리스트(Edge List) - 간선들의 나열, [u,v] 또는 [u,v,w]
    3. 인접 행렬(Adjacency Matrix) - mat[u][v]
'''


'''
    대표 문제 및 권장 알고리즘
    1. 무가중치 최단거리: BFS
    2. 무가중치 최단거리 경로: BFS+DFS
    3. 격자 BFS/DFS: visited[y][x] 통해 전체 탐색
'''

# ------ 1. 인접 리스트 -------
# 비가중치 그래프 
graph={
    1: [2,4],
    2: [3,5,6],
    3: [6],
    4: [3,7],
    5: [8],
    6: [5],
    7: [6,8],
    8: []
}

# 가중치 그래프 
graph2={
    1: [(2,2),(1,4)],
    2: [(1,3),(9,5),(6,6)],
    3: [(4,6)],
    4: [(3,3),(5,7)],
    5: [(1,8)],
    6: [(3,5)],
    7: [(7,6),(9,8)],
    8: []
}

# ------ 2. 간선 리스트 ---------
# 비가중치 그래프
graph4 = [[2,1],[2,3],[2,4],[4,3]]

# 가중치 그래프 
graph3=[[2,1,2],[2,3,5],[2,4,1],[4,3,3]]


# ------ 3. 인접 행렬 ----------
# 비가중치 그래프
# 정점 1..8 (행: from, 열: to)
mat_unweighted = [
#  to: 1 2 3 4 5 6 7 8
    [0,1,0,1,0,0,0,0],  # from 1: 1→2, 1→4
    [0,0,1,0,1,1,0,0],  # from 2: 2→3, 2→5, 2→6
    [0,0,0,0,0,1,0,0],  # from 3: 3→6
    [0,0,1,0,0,0,1,0],  # from 4: 4→3, 4→7
    [0,0,0,0,0,0,0,1],  # from 5: 5→8
    [0,0,0,0,1,0,0,0],  # from 6: 6→5
    [0,0,0,0,0,1,0,1],  # from 7: 7→6, 7→8
    [0,0,0,0,0,0,0,0],  # from 8: (없음)
]

# 가중치 그래프
# 정점 1..8 (행: from, 열: to) — 없는 간선은 0
mat_weighted = [
#  to: 1 2 3 4 5 6 7 8
    [0,2,0,1,0,0,0,0],  # 1→2(2), 1→4(1)
    [0,0,1,0,9,6,0,0],  # 2→3(1), 2→5(9), 2→6(6)
    [0,0,0,0,0,4,0,0],  # 3→6(4)
    [0,0,3,0,0,0,5,0],  # 4→3(3), 4→7(5)
    [0,0,0,0,0,0,0,1],  # 5→8(1)
    [0,0,0,0,3,0,0,0],  # 6→5(3)
    [0,0,0,0,0,7,0,9],  # 7→6(7), 7→8(9)
    [0,0,0,0,0,0,0,0],  # 8: 없음
]




# DFS/BFS/다익스트라에는 인접 리스트가 최적임. 만약 간선 리스트가 주어진다면 인접 리스트로 변환하여 풀기
# 간선 리스트 -> 인접 리스트
from collections import defaultdict
# 1. 무가중치
def edges_to_adj(edges, directed=True):
    adj = defaultdict(list)
    for u,v in edges:
        adj[u].append(v)
        if not directed: # 무방향 그래프면 반대쪽도 추가
            adj[v].append(u)
    return adj

    
# 2. 가중치
def edges_to_adj_w(edges_w, directed=True):
    adj_w = defaultdict(list)
    for u,v,w in edges_w:
        adj_w[u].append((v,w))
        if not directed: # 혹시 무방향 그래프면 반대쪽도 추가
            adj_w[v].append((u,w))
    return adj_w

# 테스트
edges   = [[2,1],[2,3],[2,4],[4,3]]
edges_w = [[2,1,2],[2,3,5],[2,4,1],[4,3,3]]

print(edges_to_adj(edges))
print(edges_to_adj_w(edges_w))